{
  "backend/main.mo": "Main backend actor implementing task management, user registration, referral system, and role-based access control with admin and user permissions. Includes functions for profile management, task CRUD operations, and user approval workflows.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: updating registration success message to 'Registration Successful! You can now log in' and implementing automatic redirect to login page after registration.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including pages (Home, Register, Login, Dashboard, AdminPanel), components (Header, TaskList, ReferralSection), and configuration files with details about auto-approval flow and UI styling.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system variables for light and dark modes with neutral grayscale theme (no blue hues in color values).",
  "frontend/index.html": "HTML entry point with page title 'MHS Online Earn Platform' and root div for React application mounting.",
  "frontend/src/App.tsx": "Main React application with TanStack Router configuration defining all routes (home, register, login, dashboard, admin-panel, job-task, withdraw, refer-earn, payment-proof, support) with shared Layout component including Header, FloatingFacebookButton, and Toaster.",
  "frontend/src/components/FloatingFacebookButton.tsx": "Fixed-position floating button in bottom-right corner that opens Facebook profile link in new tab, styled with blue background color.",
  "frontend/src/components/FloatingWhatsAppButton.tsx": "Empty file with no content (WhatsApp button has been replaced by Facebook button).",
  "frontend/src/components/Header.tsx": "Responsive navigation header with blue background, displaying six menu items (Home, Job Task, Withdraw, Refer & Earn, Payment Proof, Support) with hamburger menu for mobile devices.",
  "frontend/src/components/JobCard.tsx": "Reusable card component displaying individual job tasks with 10-second countdown timer, showing idle/running/complete states with start and reset functionality.",
  "frontend/src/components/ReferralSection.tsx": "Card component displaying referral statistics (count and earnings) with copyable referral link and toast notification on copy action.",
  "frontend/src/components/TaskList.tsx": "Displays a list of tasks with completion status, rewards, and a button to complete each task. Uses mutation hooks to handle task completion and shows loading/success states with toast notifications.",
  "frontend/src/components/TaskManagementPanel.tsx": "Admin panel component for adding and deleting tasks with a form for new task creation and a table displaying existing tasks. Includes validation, loading states, and refresh callbacks.",
  "frontend/src/components/UserManagementTable.tsx": "Displays a table of registered users showing username, email, WhatsApp, group number, total earnings, and approval status. Shows empty state when no users exist.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Initializes access control with admin token and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality. Creates and manages AuthClient with configurable options and tracks authentication status throughout the login flow.",
  "frontend/src/hooks/useQueries.ts": "Defines all React Query hooks for data fetching and mutations including user profiles, task management, registration, and referral operations. Each hook integrates with the actor and handles query invalidation on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space. Defines design tokens for colors, borders, and chart styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component into the DOM.",
  "frontend/src/pages/AdminLogin.tsx": "Empty file with no content.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page with hardcoded login (username: 'admin', password: 'habibur123') that displays tabs for user management and task management, fetching all users and tasks via custom hooks.",
  "frontend/src/pages/Dashboard.tsx": "User dashboard page that displays profile stats (earnings, completed tasks, referrals), daily tasks list, and referral section; redirects unauthenticated or unapproved users to appropriate pages.",
  "frontend/src/pages/Home.tsx": "Landing page with hero section featuring background image, platform statistics (users, earnings, tasks), and feature cards promoting the earning platform with navigation to login/register.",
  "frontend/src/pages/JobTask.tsx": "Simple page displaying a grid of 10 job cards for daily tasks with instructions to complete each task by starting a 10-second timer.",
  "frontend/src/pages/Login.tsx": "Login page using Internet Identity authentication that checks user approval status and redirects approved users to dashboard or shows pending approval message.",
  "frontend/src/pages/PaymentProof.tsx": "Static page displaying a list of recent payment proofs with hardcoded sample data showing anonymized usernames, amounts, dates, and paid status badges.",
  "frontend/src/pages/ReferAndEarn.tsx": "Referral program page showing how-it-works steps and displaying the user's referral section with their unique referral code; requires authentication.",
  "frontend/src/pages/Register.tsx": "User registration page with form fields for username, WhatsApp number, group number, email, password, and referral code. Integrates Internet Identity authentication and validates inputs before submitting registration to backend.",
  "frontend/src/pages/Support.tsx": "Support center page displaying Facebook contact button, response time information, 24/7 support availability, and FAQ section covering withdrawals, referrals, and daily tasks.",
  "frontend/src/pages/Withdraw.tsx": "Withdrawal request page with form for entering amount (minimum $10), selecting payment method (bank transfer, PayPal, or cryptocurrency), and providing account details.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, container settings, extended theme with animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata defining the MHS Online Earn Platform with features including user registration, daily tasks, referral system, admin panel, and architectural notes about authentication, mobile-first design, and known routing issues."
}