{
  "backend/main.mo": "Main Motoko actor implementing task management, user registration, and authorization with access control. Provides admin and user functions for managing tasks, profiles, referrals, and earnings with Principal-based authentication.",
  "feature_evidence.json": "Feature evidence report documenting three admin panel route fixes: resolving black screen issues, verifying admin login with hardcoded credentials (admin/habibur123), and ensuring accessibility without Internet Identity.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, authentication, admin panel, user dashboard, task management, and UI components with blue/white theme styling.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system variables for light and dark modes with neutral grayscale palette (no blue theme colors defined here).",
  "frontend/index.html": "HTML entry point with page title 'MHS Online Earn Platform' and root div for React mounting.",
  "frontend/src/App.tsx": "TanStack Router configuration defining all application routes (home, register, login, dashboard, job-task, withdraw, refer-earn, payment-proof, support, admin-panel) with shared layout including Header, FloatingFacebookButton, and Toaster.",
  "frontend/src/components/FloatingFacebookButton.tsx": "Fixed-position floating button in bottom-right corner that opens Facebook profile link in new tab with blue background styling.",
  "frontend/src/components/FloatingWhatsAppButton.tsx": "Empty file (no content).",
  "frontend/src/components/Header.tsx": "Responsive navigation header with logo and six menu items (Home, Job Task, Withdraw, Refer & Earn, Payment Proof, Support), featuring hamburger menu for mobile and blue background color.",
  "frontend/src/components/JobCard.tsx": "Reusable job card component with independent state management for 10-second countdown timer, displaying idle/running/complete states with start and reset functionality.",
  "frontend/src/components/ReferralSection.tsx": "Displays referral statistics (count and earnings) and provides a copyable referral link with visual feedback using a card layout.",
  "frontend/src/components/TaskList.tsx": "Renders a list of tasks with completion status, reward badges, and buttons to complete tasks; shows visual indicators for completed vs. pending tasks.",
  "frontend/src/components/TaskManagementPanel.tsx": "Admin panel for adding new tasks via a form and displaying/deleting existing tasks in a table; includes validation and loading states.",
  "frontend/src/components/UserManagementTable.tsx": "Admin table displaying registered users with their details and approval status; provides approve button for pending users.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with authentication, initializes access control, and invalidates dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality with configurable AuthClient options and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, task management, referrals, withdrawals, and admin functions with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like backgrounds, borders, and charts using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/AdminLogin.tsx": "Empty file with no content.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard with local authentication (username: admin, password: habibur123) that displays user management and task management panels in tabs, with login/logout functionality.",
  "frontend/src/pages/Dashboard.tsx": "User dashboard showing earnings stats, completed tasks, referrals, and daily tasks list; redirects unauthenticated or unapproved users to login/register pages.",
  "frontend/src/pages/Home.tsx": "Landing page with hero section featuring background image, platform statistics (5000+ users, $50k+ paid), and feature cards promoting the earning platform with CTA buttons for register/login.",
  "frontend/src/pages/JobTask.tsx": "Displays a grid of 10 daily task cards (JobCard components) that users can complete to earn rewards with 10-second timers.",
  "frontend/src/pages/Login.tsx": "Login page using Internet Identity authentication; checks user approval status and redirects approved users to dashboard or shows pending approval message.",
  "frontend/src/pages/PaymentProof.tsx": "Displays a list of recent payment proofs showing anonymized usernames, withdrawal amounts, dates, and paid status badges to demonstrate platform credibility.",
  "frontend/src/pages/ReferAndEarn.tsx": "Displays the referral program page with instructions on how to share referral links and earn rewards. Requires authentication and redirects unauthenticated users to login or registration.",
  "frontend/src/pages/Register.tsx": "User registration page that collects username, WhatsApp number, group number, email, password, and optional referral code. Validates inputs, authenticates with Internet Identity, and creates a user profile with a unique referral code.",
  "frontend/src/pages/Support.tsx": "Support center page displaying contact information with a Facebook messenger link, response time details, and FAQ section covering withdrawals, referrals, and daily tasks.",
  "frontend/src/pages/Withdraw.tsx": "Withdrawal request page with form for entering amount, payment method (bank/PayPal/crypto), and account details. Shows minimum withdrawal of $10 and 1-3 business day processing time.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, border radius variables, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file tracking the MHS Online Earn Platform with 15 versions, documenting features like user registration, daily tasks, referral system, admin panel, and mobile-responsive design. Contains known issue with /admin-panel route showing black screen in production due to routing misconfiguration."
}