{
  "backend/main.mo": "Main Motoko actor implementing a task-based earning platform with user registration, task management, referral system, withdrawal requests, and role-based access control using MixinAuthorization.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of all frontend components, pages, and configuration files describing the MHS Online Earn Platform's UI structure and functionality.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS variables for light and dark themes with neutral grayscale colors (no blue theme applied here).",
  "frontend/index.html": "HTML entry point for the React application with title 'MHS Online Earn Platform' and root div mounting point.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with all routes (home, auth, dashboard, admin panels, job tasks, withdraw, referral, payment proof, support) and shared layout with Header, FloatingFacebookButton, and Toaster.",
  "frontend/src/components/FloatingFacebookButton.tsx": "Fixed-position floating button in bottom-right corner with Facebook icon that opens a specific Facebook profile in a new tab, styled with blue OKLCH colors.",
  "frontend/src/components/FloatingWhatsAppButton.tsx": "Empty file with no content.",
  "frontend/src/components/Header.tsx": "Responsive navigation header with logo, desktop menu, and mobile hamburger menu displaying six navigation items (Home, Job Task, Withdraw, Refer & Earn, Payment Proof, Support) with blue background styling.",
  "frontend/src/components/JobCard.tsx": "Reusable card component displaying a single job task with three states (idle, running with 10-second countdown timer, complete) and start/reset buttons.",
  "frontend/src/components/ReferralSection.tsx": "Card component displaying referral statistics (count and earnings) with a copyable referral link input field and copy-to-clipboard functionality using toast notifications.",
  "frontend/src/components/TaskList.tsx": "Displays a list of tasks with completion status, rewards, and a button to complete each task. Uses mutation hooks to handle task completion and shows loading/success states.",
  "frontend/src/components/TaskManagementPanel.tsx": "Admin panel component for adding and deleting tasks with a form for new task creation and a table displaying existing tasks. Handles task CRUD operations via mutation hooks.",
  "frontend/src/components/UserManagementTable.tsx": "Displays a table of registered users showing username, email, WhatsApp, group number, total earnings, and approval status. Renders empty state when no users exist.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with authentication, handling identity changes and initializing access control with admin token from URL parameters.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, managing auth client creation, identity persistence, and login status states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, authentication, registration, balance management, task operations, and withdrawal requests with proper cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors using OKLCH color space, defining design tokens for UI components.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminLogin.tsx": "File appears to be empty or contains only whitespace/comments.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page with local authentication (username: 'admin', password: 'habibur123') that displays tabs for user management and task management, fetching all users and tasks via queries.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that checks user authentication and approval status, displays user profile, balance, daily tasks, referral section, and platform statistics with navigation to job tasks and support.",
  "frontend/src/pages/Home.tsx": "Landing page with hero section (background image), platform statistics (users, earnings, tasks), and feature cards promoting the MHS Online Earn Platform with navigation to register/login.",
  "frontend/src/pages/JobTask.tsx": "Job task page displaying a grid of 10 daily task cards that users can complete to earn rewards.",
  "frontend/src/pages/Login.tsx": "Login page with username/password form that authenticates users via mutation and redirects to dashboard on success, with special handling for post-registration redirect.",
  "frontend/src/pages/MhsAdminPanel.tsx": "Admin panel for manually adding balance to user accounts by username, with form validation and mutation handling.",
  "frontend/src/pages/PaymentProof.tsx": "Static page displaying a list of recent successful withdrawal proofs with user IDs (masked), amounts, dates, and paid status badges.",
  "frontend/src/pages/ReferAndEarn.tsx": "Displays the referral program page with user's referral code, explains the three-step referral process (share link, friend signs up, earn rewards), and redirects unauthenticated or unregistered users.",
  "frontend/src/pages/Register.tsx": "User registration form that validates username, WhatsApp number (11 digits starting with '01'), email, password, and optional referral code from URL; creates user profile with generated referral code and redirects to login on success.",
  "frontend/src/pages/Support.tsx": "Support center page displaying Facebook contact button, response time info, 24/7 support availability, and FAQ section covering withdrawals, referrals, and daily task limits.",
  "frontend/src/pages/Withdraw.tsx": "Withdrawal request form with phone number, payment method, and amount inputs; displays withdrawal history table with timestamps and validates 11-digit phone numbers starting with '01'.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and methods to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with OKLCH color system, custom theme extensions for borders/colors/animations, container queries, typography plugin, and accordion keyframe animations.",
  "project_state.json": "Project metadata indicating Version 3 with known routing issues at /mhs-admin-panel and four pending action requests to fix routing, TypeScript errors, backend compilation, and clean deployment."
}