{
  "backend/main.mo": "Main Motoko actor implementing a task-based earning platform with user profiles, task management, referral system, role-based access control (admin/user), and functions for registration, approval, task completion, and earnings tracking.",
  "feature_evidence.json": "Feature evidence report documenting four completed features related to replacing the old-man hero image with a user photo, applying a dark overlay, and configuring fixed background attachment on the Home page.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including pages (Home, Register, Login, Dashboard, Admin), components (Header, TaskList, JobCard, FloatingFacebookButton), hooks (useQueries), and configuration files with their key functionality.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system variables for light and dark modes with neutral grayscale palette (no blue theme applied here despite comments in summaries).",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'MHS★Online Earn Platform', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "TanStack Router setup defining 11 routes (home, register, login, dashboard, job-task, withdraw, refer-earn, payment-proof, support, admin-login, admin-panel) with shared Layout component containing Header and FloatingFacebookButton.",
  "frontend/src/components/FloatingFacebookButton.tsx": "Fixed-position floating button in bottom-right corner with Facebook icon that opens a specific Facebook profile URL in a new tab, styled with blue OKLCH colors.",
  "frontend/src/components/FloatingWhatsAppButton.tsx": "Empty file with no content.",
  "frontend/src/components/Header.tsx": "Responsive navigation header with logo, six menu items (Home, Job Task, Withdraw, Refer & Earn, Payment Proof, Support), mobile hamburger menu, and blue background styling using OKLCH colors.",
  "frontend/src/components/JobCard.tsx": "Reusable job card component with three states (idle, running, complete) featuring a start button, 10-second countdown timer with animated clock icon, completion message with checkmark, and reset functionality.",
  "frontend/src/components/ReferralSection.tsx": "Displays referral statistics (count and earnings) and provides a copyable referral link with visual feedback using clipboard API and toast notifications.",
  "frontend/src/components/TaskList.tsx": "Renders a list of tasks with completion status indicators, reward badges, and buttons to complete tasks; handles task completion mutations with loading states.",
  "frontend/src/components/TaskManagementPanel.tsx": "Admin panel for adding new tasks via form and displaying/deleting existing tasks in a table; manages task CRUD operations with mutation hooks.",
  "frontend/src/components/UserManagementTable.tsx": "Admin table displaying user profiles with approval status badges and action buttons to approve pending users using Principal-based mutations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with identity-based authentication, initializes access control with admin token, and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, task management, referrals, withdrawals, and admin functions with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like backgrounds, borders, and charts using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page with hardcoded credentials (admin/habibur123) that stores authentication state in localStorage and redirects to admin panel on success.",
  "frontend/src/pages/AdminPanel.tsx": "Protected admin dashboard with tabs for user and task management, displaying tables of all users and tasks with refresh capabilities and logout functionality.",
  "frontend/src/pages/Dashboard.tsx": "User dashboard showing earnings stats, completed tasks count, referrals, and daily task list; redirects unauthenticated or unapproved users to appropriate pages.",
  "frontend/src/pages/Home.tsx": "Landing page with hero section featuring background image, user statistics, call-to-action buttons for registration and Facebook support, and feature cards highlighting platform benefits.",
  "frontend/src/pages/JobTask.tsx": "Page displaying a grid of 10 daily job task cards with instructions for completing tasks to earn rewards.",
  "frontend/src/pages/Login.tsx": "Login page using Internet Identity authentication that checks user approval status and redirects approved users to dashboard or shows pending approval message.",
  "frontend/src/pages/PaymentProof.tsx": "Static page displaying a list of recent successful payment withdrawals with user IDs (anonymized), amounts, dates, and paid status badges.",
  "frontend/src/pages/ReferAndEarn.tsx": "Displays the referral program page with authentication checks, showing how the referral system works and rendering the ReferralSection component with the user's referral code.",
  "frontend/src/pages/Register.tsx": "User registration page that collects username, WhatsApp, email, password, and optional referral code, validates inputs, authenticates via Internet Identity, and creates a user profile pending admin approval.",
  "frontend/src/pages/Support.tsx": "Support center page displaying contact information with a Facebook messenger link, response time details, and a FAQ section covering withdrawals, referrals, and daily tasks.",
  "frontend/src/pages/Withdraw.tsx": "Withdrawal request page with a form for users to specify amount (minimum $10), payment method (bank/PayPal/crypto), and account details for processing earnings withdrawals.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and parameter cleanup functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, extended animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file tracking the MHS★Online Earn Platform with 9 versions, documenting features like user registration, daily tasks, referral system, admin panel with local auth (admin/habibur123), and mobile-responsive blue/white theme. Contains architectural notes for mobile-first design, Facebook integration, timer functionality, and background image implementation."
}